# PartStatus Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..PartStatus Property
FabricationPart Class See Also
---
The status identifier for the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public int PartStatus { get; set; }
```

Visual Basic
---
```text
Public Property PartStatus As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int PartStatus {
	int get ();
	void set (int value);
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace